###################################################################

# Created by write_sdc on Sun Apr 10 10:54:18 2022

###################################################################
set sdc_version 1.7

set_units -time ns -resistance kOhm -capacitance pF -power mW -voltage V       \
-current mA
set_max_fanout 4 [current_design]
set_max_area 0
set_driving_cell -lib_cell INVX1TS [get_ports clk]
set_driving_cell -lib_cell INVX1TS [get_ports CEN]
set_driving_cell -lib_cell INVX1TS [get_ports WEN]
set_driving_cell -lib_cell INVX1TS [get_ports {A[14]}]
set_driving_cell -lib_cell INVX1TS [get_ports {A[13]}]
set_driving_cell -lib_cell INVX1TS [get_ports {A[12]}]
set_driving_cell -lib_cell INVX1TS [get_ports {A[11]}]
set_driving_cell -lib_cell INVX1TS [get_ports {A[10]}]
set_driving_cell -lib_cell INVX1TS [get_ports {A[9]}]
set_driving_cell -lib_cell INVX1TS [get_ports {A[8]}]
set_driving_cell -lib_cell INVX1TS [get_ports {A[7]}]
set_driving_cell -lib_cell INVX1TS [get_ports {A[6]}]
set_driving_cell -lib_cell INVX1TS [get_ports {A[5]}]
set_driving_cell -lib_cell INVX1TS [get_ports {A[4]}]
set_driving_cell -lib_cell INVX1TS [get_ports {A[3]}]
set_driving_cell -lib_cell INVX1TS [get_ports {A[2]}]
set_driving_cell -lib_cell INVX1TS [get_ports {A[1]}]
set_driving_cell -lib_cell INVX1TS [get_ports {A[0]}]
set_driving_cell -lib_cell INVX1TS [get_ports {D[7]}]
set_driving_cell -lib_cell INVX1TS [get_ports {D[6]}]
set_driving_cell -lib_cell INVX1TS [get_ports {D[5]}]
set_driving_cell -lib_cell INVX1TS [get_ports {D[4]}]
set_driving_cell -lib_cell INVX1TS [get_ports {D[3]}]
set_driving_cell -lib_cell INVX1TS [get_ports {D[2]}]
set_driving_cell -lib_cell INVX1TS [get_ports {D[1]}]
set_driving_cell -lib_cell INVX1TS [get_ports {D[0]}]
set_load -pin_load 1 [get_ports {Q[7]}]
set_load -pin_load 1 [get_ports {Q[6]}]
set_load -pin_load 1 [get_ports {Q[5]}]
set_load -pin_load 1 [get_ports {Q[4]}]
set_load -pin_load 1 [get_ports {Q[3]}]
set_load -pin_load 1 [get_ports {Q[2]}]
set_load -pin_load 1 [get_ports {Q[1]}]
set_load -pin_load 1 [get_ports {Q[0]}]
set_max_capacitance 0.005 [get_ports clk]
set_max_capacitance 0.005 [get_ports CEN]
set_max_capacitance 0.005 [get_ports WEN]
set_max_capacitance 0.005 [get_ports {A[14]}]
set_max_capacitance 0.005 [get_ports {A[13]}]
set_max_capacitance 0.005 [get_ports {A[12]}]
set_max_capacitance 0.005 [get_ports {A[11]}]
set_max_capacitance 0.005 [get_ports {A[10]}]
set_max_capacitance 0.005 [get_ports {A[9]}]
set_max_capacitance 0.005 [get_ports {A[8]}]
set_max_capacitance 0.005 [get_ports {A[7]}]
set_max_capacitance 0.005 [get_ports {A[6]}]
set_max_capacitance 0.005 [get_ports {A[5]}]
set_max_capacitance 0.005 [get_ports {A[4]}]
set_max_capacitance 0.005 [get_ports {A[3]}]
set_max_capacitance 0.005 [get_ports {A[2]}]
set_max_capacitance 0.005 [get_ports {A[1]}]
set_max_capacitance 0.005 [get_ports {A[0]}]
set_max_capacitance 0.005 [get_ports {D[7]}]
set_max_capacitance 0.005 [get_ports {D[6]}]
set_max_capacitance 0.005 [get_ports {D[5]}]
set_max_capacitance 0.005 [get_ports {D[4]}]
set_max_capacitance 0.005 [get_ports {D[3]}]
set_max_capacitance 0.005 [get_ports {D[2]}]
set_max_capacitance 0.005 [get_ports {D[1]}]
set_max_capacitance 0.005 [get_ports {D[0]}]
set_max_fanout 4 [get_ports clk]
set_max_fanout 4 [get_ports CEN]
set_max_fanout 4 [get_ports WEN]
set_max_fanout 4 [get_ports {A[14]}]
set_max_fanout 4 [get_ports {A[13]}]
set_max_fanout 4 [get_ports {A[12]}]
set_max_fanout 4 [get_ports {A[11]}]
set_max_fanout 4 [get_ports {A[10]}]
set_max_fanout 4 [get_ports {A[9]}]
set_max_fanout 4 [get_ports {A[8]}]
set_max_fanout 4 [get_ports {A[7]}]
set_max_fanout 4 [get_ports {A[6]}]
set_max_fanout 4 [get_ports {A[5]}]
set_max_fanout 4 [get_ports {A[4]}]
set_max_fanout 4 [get_ports {A[3]}]
set_max_fanout 4 [get_ports {A[2]}]
set_max_fanout 4 [get_ports {A[1]}]
set_max_fanout 4 [get_ports {A[0]}]
set_max_fanout 4 [get_ports {D[7]}]
set_max_fanout 4 [get_ports {D[6]}]
set_max_fanout 4 [get_ports {D[5]}]
set_max_fanout 4 [get_ports {D[4]}]
set_max_fanout 4 [get_ports {D[3]}]
set_max_fanout 4 [get_ports {D[2]}]
set_max_fanout 4 [get_ports {D[1]}]
set_max_fanout 4 [get_ports {D[0]}]
set_ideal_network [get_ports clk]
create_clock [get_ports clk]  -period 4  -waveform {0 2}
set_clock_uncertainty 0  [get_clocks clk]
set_clock_transition -max -rise 0.01 [get_clocks clk]
set_clock_transition -max -fall 0.01 [get_clocks clk]
set_clock_transition -min -rise 0.01 [get_clocks clk]
set_clock_transition -min -fall 0.01 [get_clocks clk]
set_input_delay -clock clk  0.05  [get_ports CEN]
set_input_delay -clock clk  0.05  [get_ports WEN]
set_input_delay -clock clk  0.05  [get_ports {A[14]}]
set_input_delay -clock clk  0.05  [get_ports {A[13]}]
set_input_delay -clock clk  0.05  [get_ports {A[12]}]
set_input_delay -clock clk  0.05  [get_ports {A[11]}]
set_input_delay -clock clk  0.05  [get_ports {A[10]}]
set_input_delay -clock clk  0.05  [get_ports {A[9]}]
set_input_delay -clock clk  0.05  [get_ports {A[8]}]
set_input_delay -clock clk  0.05  [get_ports {A[7]}]
set_input_delay -clock clk  0.05  [get_ports {A[6]}]
set_input_delay -clock clk  0.05  [get_ports {A[5]}]
set_input_delay -clock clk  0.05  [get_ports {A[4]}]
set_input_delay -clock clk  0.05  [get_ports {A[3]}]
set_input_delay -clock clk  0.05  [get_ports {A[2]}]
set_input_delay -clock clk  0.05  [get_ports {A[1]}]
set_input_delay -clock clk  0.05  [get_ports {A[0]}]
set_input_delay -clock clk  0.05  [get_ports {D[7]}]
set_input_delay -clock clk  0.05  [get_ports {D[6]}]
set_input_delay -clock clk  0.05  [get_ports {D[5]}]
set_input_delay -clock clk  0.05  [get_ports {D[4]}]
set_input_delay -clock clk  0.05  [get_ports {D[3]}]
set_input_delay -clock clk  0.05  [get_ports {D[2]}]
set_input_delay -clock clk  0.05  [get_ports {D[1]}]
set_input_delay -clock clk  0.05  [get_ports {D[0]}]
set_output_delay -clock clk  0.05  [get_ports {Q[7]}]
set_output_delay -clock clk  0.05  [get_ports {Q[6]}]
set_output_delay -clock clk  0.05  [get_ports {Q[5]}]
set_output_delay -clock clk  0.05  [get_ports {Q[4]}]
set_output_delay -clock clk  0.05  [get_ports {Q[3]}]
set_output_delay -clock clk  0.05  [get_ports {Q[2]}]
set_output_delay -clock clk  0.05  [get_ports {Q[1]}]
set_output_delay -clock clk  0.05  [get_ports {Q[0]}]
